export const colorLabel = [{
    aqi:'0-50',
    color: 'bg-emerald-500',
    label: 'ดีมาก',
    healthImplications: 'คุณภาพอากาศดีมาก มลพิษทางอากาศก็มีความเสี่ยงเพียงเล็กน้อยหรืออาจจะไม่มีเลย',
    cautionaryStatement: 'ไม่มี'
},
{
    aqi:'51-100',
    color: 'bg-green-500',
    label: 'ดี',
    healthImplications: 'คุณภาพอากาศดี สำหรับมลพิษบางชนิดอาจมีความกังวลเรื่องสุขภาพในระดับปานกลางสำหรับคนจำนวนน้อยมากที่ไวต่อมลพิษทางอากาศอย่างผิดปกติ',
    cautionaryStatement: 'เด็กและผู้ใหญ่ที่ต้องไปทำกิจกรรมข้างนอกบ้าน และผู้ที่เป็นโรคระบบทางเดินหายใจ เช่น โรคหอบหืด ควรจำกัดการออกกำลังกายกลางแจ้งเป็นเวลานานๆ'
},
{
    aqi:'101-150',
    color: 'bg-yellow-500',
    label: 'ปานกลาง',
    healthImplications: 'กลุ่มที่มีความอ่อนไหวอาจได้รับผลกระทบต่อสุขภาพ ประชาชนทั่วไปไม่น่าจะได้รับผลกระทบ',
    cautionaryStatement: 'เด็กและผู้ใหญ่ที่ต้องไปทำกิจกรรมข้างนอกบ้าน และผู้ที่เป็นโรคระบบทางเดินหายใจ เช่น โรคหอบหืด ควรจำกัดการออกกำลังกายกลางแจ้งเป็นเวลานานๆ'
},
{
    aqi:'151-200',
    color: 'bg-orange-500',
    label: 'เริ่มอันตราย',
    healthImplications: 'เริ่มมีผลกระทบต่อสุขภาพ สมาชิกของกลุ่มที่มีความอ่อนไหวอาจได้รับผลกระทบด้านสุขภาพที่รุนแรงยิ่งขึ้น',
    cautionaryStatement: 'เด็กและผู้ใหญ่ที่ต้องไปทำกิจกรรมข้างนอกบ้าน และผู้ที่เป็นโรคระบบทางเดินหายใจ เช่น โรคหอบหืด ควรหลีกเลี่ยงการออกแรงกลางแจ้งเป็นเวลานาน คนอื่นๆโดยเฉพาะเด็กๆ ควรจำกัดการออกกำลังกายกลางแจ้งเป็นเวลานานๆ'
},
{
    aqi:'201-300',
    color: 'bg-red-500',
    label: 'อันตราย',
    healthImplications: 'ภาวะฉุกเฉิน ประชากรทั้งหมดมีแนวโน้มที่จะได้รับผลกระทบมากขึ้น',
    cautionaryStatement: 'เด็กและผู้ใหญ่ที่ต้องไปทำกิจกรรมข้างนอกบ้าน และผู้ที่เป็นโรคระบบทางเดินหายใจ เช่น โรคหอบหืด ควรหลีกเลี่ยงการออกแรงกลางแจ้งเป็นเวลานาน คนอื่นๆโดยเฉพาะเด็กๆ ควรจำกัดการออกกำลังกายกลางแจ้งเป็นเวลานานๆ'
},
{
    aqi:'300+',
    color: 'bg-purple-500',
    label: 'อันตรายมาก',
    healthImplications: 'ทุกคนอาจได้รับผลกระทบด้านสุขภาพที่รุนแรงมากขึ้น',
    cautionaryStatement: 'ทุกคนควรหลีกเลี่ยงการทำกิจกรรมนอกบ้าน'
}
]